home/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Garrett Hill at a Glance</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Garrett Hill at a Glance</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="file:///home/runner/Me/content/personal/personal.html">Personal Projects</a></td>
<td class="org-left"><a href="file:///home/runner/Me/content/activism/activism.html">Activism Projects</a></td>
<td class="org-left"><a href="file:///home/runner/Me/content/school/school.html">School Projects</a></td>
<td class="org-left"><a href="file:///home/runner/Me/content/work/work.html">Work Projects</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orgad4f80d" class="outline-2">
<h2 id="orgad4f80d"><a href="personal.html">Personal Projects</a></h2>
<div class="outline-text-2" id="text-orgad4f80d">
<ul class="org-ul">
<li>Desktop dotfiles</li>
</ul>
</div>
</div>

<div id="outline-container-orgca09ee3" class="outline-2">
<h2 id="orgca09ee3"><a href="activism.html">Activism Projects</a></h2>
<div class="outline-text-2" id="text-orgca09ee3">
<ul class="org-ul">
<li>Ruben Amaya for Baltimore County District 10 Campaign</li>
</ul>
</div>
</div>

<div id="outline-container-org0c702db" class="outline-2">
<h2 id="org0c702db"><a href="school.html">School Projects</a></h2>
<div class="outline-text-2" id="text-org0c702db">
<ul class="org-ul">
<li>Optimal Posting Strategies on Reddit</li>
<li>Targeted Property Based Testing in Haskell</li>
<li>Lyric Analysis via Genius in Rust</li>
</ul>
</div>
</div>

<div id="outline-container-orgf74fc5b" class="outline-2">
<h2 id="orgf74fc5b"><a href="work.html">Work Projects</a></h2>
</div>

<div id="outline-container-orgd5701cc" class="outline-2">
<h2 id="orgd5701cc">Links and Resources</h2>
<div class="outline-text-2" id="text-orgd5701cc">
<ul class="org-ul">
<li><a href="https://github.com/gahill18/gahill18.github.io">This website's source code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1a3e115" class="outline-2">
<h2 id="org1a3e115">About Me</h2>
<div class="outline-text-2" id="text-org1a3e115">
<p>
I am a current graduate student at the University of Maryland getting my M.E. in Cybersecurity. I'm interested in programming language design, automation of work, and all kinds of other things! You can contact me at <a href="mailto:gahill2018@pm.me">gahill2018@pm.me</a>, or check out my github <a href="https://github.com/gahill18">here</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
